import Task1 from "./components/Task1/Task1";
import Task2 from "./components/Task2/Task2";
import Task3 from "./components/Task3/Task3";
import Task4 from "./components/Task4/Task4";
import Task5 from "./components/Task5/Task5";
import Task6 from "./components/Task6/Task6";


export const tasks = [
	{
		id: 1,
		title: "Задача 1",
		text1:
			"Вводимо логіна і пароль. Якщо логін вірний відображаємо смайл. Якщо ні, то:",
		text2: "1) якщо логін = Ivan – колір повідомлення про помилку синій",
		text3: "2) якщо хтось інший, то колір повідомлення червоний",
		text4:
			"Логін: admin, Пароль: admin111; Логін: admin2, Пароль: admin222; Логін: admin3, Пароль: admin333. ",
		Component: Task1,
	},

	{
		id: 2,
		title: "Задача 2",
		text1: "З випадаючого списку вибираємо клас квитка у літаку. Якщо :",
		text2:
			"1) бізнес - виводимо елементи для вибору газети та коньяку (якщо вибрано коньяк, то запропонувати закуску (так/ні)), на фоні зображення бізнес кают",
		text3:
			"2) економ – виводимо елементи для вибору типу пива і чипсів, на фоні хмарки.",
		Component: Task2,
	},

	{
		id: 3,
		title: "Задача 3",
		text1: "Елемент тренажера англійської.",
		text2:
			"Виводимо зображення елемента і слово. Користувач вводить відповідь.",
		text3:
			"Якщо вірно – відтворюємо фразу «Добре. Молодець!» (і додаємо зелену рамку до елемента), якщо ні - то відтворюємо фразу «Невірно, спробуйте ще раз» (і додаємо червону рамку).",
		Component: Task3,
	},

	{
		id: 4,
		title: "Задача 4",
		text1:
			"Вивести список як маркований список з елементами у форматі (name: salary).",
		Component: Task4,
	},

	{
		id: 5,
		title: "Задача 5",
		text1:
			"Самостійно сформуйте масив даних та виведіть фрагмент на зразок поданого в завданні (дані не обов’язково повинні співпадати).",
		Component: Task5,
	},

	{
		id: 6,
		title: "Задача 6",
		text1: "На кухню поступають замовлення.",
		text2:
			"Спочатку ми додаємо їх у список “Очікують на виконання”, якщо повар береться робити — замовлення переходить у список “Виконуються”, якщо замовлення виконано — переходить у список “Готові до виносу”. ",
		text3: "Якщо натиснути на “Подано” - страва зникає з таблиці",
		text4:
			"Підказка: тут треба зберігати 3 масиви страв ( waitingList, processingList, completedList)",
		Component: Task6,
	},
];
